---
kind: method
id: M:Autodesk.Revit.DB.WorksetKindFilter.#ctor(Autodesk.Revit.DB.WorksetKind)
source: html/31b39dd9-1aa8-84f7-660e-6983dce46999.htm
---
# Autodesk.Revit.DB.WorksetKindFilter.#ctor Method

Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind.

## Syntax (C#)
```csharp
public WorksetKindFilter(
	WorksetKind worksetKind
)
```

## Parameters
- **worksetKind** (`Autodesk.Revit.DB.WorksetKind`) - The WorksetKind to match.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration